In [109]:
import pandas as pd
import numpy as np

In [145]:
a= pd.DataFrame({'price':[1,3,5,7],'item':['sticker','mirror','glass','abc'],
                 'manufacture':[2011,2001,2012,2019]},index=['a','b','c','d'])
a.head()

   price     item  manufacture
a      1  sticker         2011
b      3   mirror         2001
c      5    glass         2012
d      7      abc         2019

In [146]:
a.loc[:'b']

   price     item  manufacture
a      1  sticker         2011
b      3   mirror         2001

In [147]:
a.loc['b']

price               3
item           mirror
manufacture      2001
Name: b, dtype: object

In [148]:
a.loc['a']['item']

'sticker'

In [149]:
a.iloc[:4]['item']

a    sticker
b     mirror
c      glass
d        abc
Name: item, dtype: object

In [151]:
data = pd.DataFrame({'price':[98,47,87,np.NaN],'ticker':['AXP','CSCO','DIS',None],
                    'company':['AE','ML','WD','MS']},index=[4,2,3,1])
data

   price ticker company
4   98.0    AXP      AE
2   47.0   CSCO      ML
3   87.0    DIS      WD
1    NaN   None      MS

In [152]:
data.loc[:1]

   price ticker company
4   98.0    AXP      AE
2   47.0   CSCO      ML
3   87.0    DIS      WD
1    NaN   None      MS

In [153]:
data.dtypes

price      float64
ticker      object
company     object
dtype: object

In [154]:
data.count()

price      3
ticker     3
company    4
dtype: int64

In [155]:
df = pd.DataFrame({'person':['jhon','myla','lewis','john','myla'],
                  'age':[24,np.NaN,21,33,26],'single':[False,True,True,False,True]})
df

  person   age  single
0   jhon  24.0   False
1   myla   NaN    True
2  lewis  21.0    True
3   john  33.0   False
4   myla  26.0    True

In [156]:
df.dtypes

person     object
age       float64
single       bool
dtype: object

In [157]:
df.count()

person    5
age       4
single    5
dtype: int64

In [158]:
df.count(axis='columns')

0    3
1    2
2    3
3    3
4    3
dtype: int64

In [159]:
df.count(axis='rows')

person    5
age       4
single    5
dtype: int64

In [160]:
df.describe()

            age
count   4.00000
mean   26.00000
std     5.09902
min    21.00000
25%    23.25000
50%    25.00000
75%    27.75000
max    33.00000

In [161]:
b=pd.Series(['a','b','c','a','b'])
print(b.describe())
print(b)

count     5
unique    3
top       a
freq      2
dtype: object
0    a
1    b
2    c
3    a
4    b
dtype: object

In [162]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 4 to 1
Data columns (total 3 columns):
price      3 non-null float64
ticker     3 non-null object
company    4 non-null object
dtypes: float64(1), object(2)
memory usage: 288.0+ bytes

In [177]:
df1=pd.DataFrame(np.arange(16).reshape((4,4)),columns=list('abcd'),index=[1,2,3,4])
df1

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [164]:
b.info()

AttributeError: 'Series' object has no attribute 'info'

In [179]:
df2=pd.DataFrame(np.arange(30).reshape((5,6)),columns=list('abcdef'),index=[1,2,3,4,5])
df2

    a   b   c   d   e   f
1   0   1   2   3   4   5
2   6   7   8   9  10  11
3  12  13  14  15  16  17
4  18  19  20  21  22  23
5  24  25  26  27  28  29

In [182]:
df2.loc[2,'c']=np.nan
df2

    a   b     c   d   e   f
1   0   1   2.0   3   4   5
2   6   7   NaN   9  10  11
3  12  13  14.0  15  16  17
4  18  19  20.0  21  22  23
5  24  25  26.0  27  28  29

In [183]:
df1+df2

      a     b     c     d   e   f
1   0.0   2.0   4.0   6.0 NaN NaN
2  10.0  12.0   NaN  16.0 NaN NaN
3  20.0  22.0  24.0  26.0 NaN NaN
4  30.0  32.0  34.0  36.0 NaN NaN
5   NaN   NaN   NaN   NaN NaN NaN

In [191]:
df1.add(df2,fill_value=1)

      a     b     c     d     e     f
1   0.0   2.0   4.0   6.0   5.0   6.0
2  10.0  12.0   7.0  16.0  11.0  12.0
3  20.0  22.0  24.0  26.0  17.0  18.0
4  30.0  32.0  34.0  36.0  23.0  24.0
5  25.0  26.0  27.0  28.0  29.0  30.0

In [209]:
df = pd.DataFrame(np.random.randint(low=5,high=30,size=15).reshape(5,3),
                  index=['a','b','c','e','h'],
                 columns=['one','two','three'])
df

   one  two  three
a   21   25      7
b    7   26      8
c    7    6     10
e    8    7     16
h   24    9     20

In [210]:
df.describe()

            one        two      three
count   5.00000   5.000000   5.000000
mean   13.40000  14.600000  12.200000
std     8.38451  10.014989   5.585696
min     7.00000   6.000000   7.000000
25%     7.00000   7.000000   8.000000
50%     8.00000   9.000000  10.000000
75%    21.00000  25.000000  16.000000
max    24.00000  26.000000  20.000000

In [211]:
df2=df.reindex(['a','b','c','d','e','f','g','h'])
df2

    one   two  three
a  21.0  25.0    7.0
b   7.0  26.0    8.0
c   7.0   6.0   10.0
d   NaN   NaN    NaN
e   8.0   7.0   16.0
f   NaN   NaN    NaN
g   NaN   NaN    NaN
h  24.0   9.0   20.0

In [212]:
df2.isnull().sum()

one      3
two      3
three    3
dtype: int64

In [213]:
df2.dropna()

    one   two  three
a  21.0  25.0    7.0
b   7.0  26.0    8.0
c   7.0   6.0   10.0
e   8.0   7.0   16.0
h  24.0   9.0   20.0

In [218]:
df2.fillna(4)

    one   two  three
a  21.0  25.0    7.0
b   7.0  26.0    8.0
c   7.0   6.0   10.0
d   4.0   4.0    4.0
e   8.0   7.0   16.0
f   4.0   4.0    4.0
g   4.0   4.0    4.0
h  24.0   9.0   20.0

In [219]:
k=pd.Series([0,1,2,3,4,5])
k

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [221]:
k.replace(0,5)

0    5
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [222]:
k.replace([1,2,3,4],[4,3,2,1])

0    0
1    4
2    3
3    2
4    1
5    5
dtype: int64

In [225]:
df3=pd.DataFrame({'A':[0,1,2,3,4,5],'B':[5,6,7,8,9,10],'C':['a','b','c','d','e','f']})
df3

   A   B  C
0  0   5  a
1  1   6  b
2  2   7  c
3  3   8  d
4  4   9  e
5  5  10  f

In [229]:
df3.replace(0,4)

   A   B  C
0  4   5  a
1  1   6  b
2  2   7  c
3  3   8  d
4  4   9  e
5  5  10  f

In [227]:
df3.replace([0,1,2,3,4],9)

   A   B  C
0  9   5  a
1  9   6  b
2  9   7  c
3  9   8  d
4  9   9  e
5  5  10  f

In [228]:
df3.replace([0,1,2,3,4,5],[6,5,4,3,2,1])

   A   B  C
0  6   1  a
1  5   6  b
2  4   7  c
3  3   8  d
4  2   9  e
5  1  10  f

In [231]:
df3.replace({0:10,1:100,2:1000})

      A   B  C
0    10   5  a
1   100   6  b
2  1000   7  c
3     3   8  d
4     4   9  e
5     5  10  f